# Data manipulation and mini-ETL project

## Data Manipulation with pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Alex', 'Sara', 'Emily', 'Saint'],
    'Age': [25, 30, 22, 28, 35],
    'Salary': [50000, 60000, 45000, 55000, 70000],
    'Department': ['Data Eng', 'Analytics', 'IT', 'HR', 'Finance']
}
df = pd.DataFrame(data)

In [4]:
# Display basic info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Salary      5 non-null      int64
 3   Department  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [5]:
# Handling Missing values
df.fillna('Unknown', inplace=True)
df.head()

    Name  Age  Salary Department
0   John   25   50000   Data Eng
1   Alex   30   60000  Analytics
2   Sara   22   45000         IT
3  Emily   28   55000         HR
4  Saint   35   70000    Finance

In [6]:
# Sorting and Filtering
high_salary = df[df['Salary'] > 50000].sort_values(by='Salary', ascending=False)
print('Employee with high salary: \n',high_salary)

Employee with high salary:
     Name  Age  Salary Department
4  Saint   35   70000    Finance
1   Alex   30   60000  Analytics
3  Emily   28   55000         HR

In [7]:
# Grouping and Aggregation
avg_salary_per_dept = df.groupby("Department")['Salary'].mean()
print('Average salary per department:\n', avg_salary_per_dept)

Average salary per department:
 Department
Analytics    60000.0
Data Eng     50000.0
Finance      70000.0
HR           55000.0
IT           45000.0
Name: Salary, dtype: float64

In [8]:
# Adding a new column
df['Bonus'] = df['Salary'] * 0.10 # 10% Bonus Calculation
print('Updated DataFrane with Bonus: \n', df)

Updated DataFrane with Bonus:
     Name  Age  Salary Department   Bonus
0   John   25   50000   Data Eng  5000.0
1   Alex   30   60000  Analytics  6000.0
2   Sara   22   45000         IT  4500.0
3  Emily   28   55000         HR  5500.0
4  Saint   35   70000    Finance  7000.0

#### Add a new column for “Experience” with random values.

In [9]:
df['Experience'] = [2, 2, 1, 3, 4]
df.head()

    Name  Age  Salary Department   Bonus  Experience
0   John   25   50000   Data Eng  5000.0           2
1   Alex   30   60000  Analytics  6000.0           2
2   Sara   22   45000         IT  4500.0           1
3  Emily   28   55000         HR  5500.0           3
4  Saint   35   70000    Finance  7000.0           4

#### Find the employee with the highest salary.

In [10]:
highest_salary = df['Salary'].max()
print('Highest Employee salary:\n',high_salary)

Highest Employee salary:
     Name  Age  Salary Department
4  Saint   35   70000    Finance
1   Alex   30   60000  Analytics
3  Emily   28   55000         HR

In [11]:
highest_sal_emp = df[df['Salary'] == df['Salary'].max()]
high_salary

    Name  Age  Salary Department
4  Saint   35   70000    Finance
1   Alex   30   60000  Analytics
3  Emily   28   55000         HR

#### Filter employees who are under 30 and earn above 50,000.

In [12]:
young_skilled_employee = df.loc[(df['Age'] < 30) & (df['Salary'] >50000)]
young_skilled_employee

    Name  Age  Salary Department   Bonus  Experience
3  Emily   28   55000         HR  5500.0           3

In [13]:
young_high_earners = df[(df['Age'] < 30) & (df['Salary'] > 50000)]
young_high_earners

    Name  Age  Salary Department   Bonus  Experience
3  Emily   28   55000         HR  5500.0           3

In [14]:
df.to_csv('employee_data.csv')
print('Data manipulation complete! Processed file saved')

Data manipulation complete! Processed file saved

## Mini ETL Project (Extract, Transform, Load)

#### Extract - Read CSV

In [15]:
df = pd.read_csv('employee_data.csv')
print('Original Data: \n', df.head())

Original Data:
    Unnamed: 0   Name  Age  Salary Department   Bonus  Experience
0           0   John   25   50000   Data Eng  5000.0           2
1           1   Alex   30   60000  Analytics  6000.0           2
2           2   Sara   22   45000         IT  4500.0           1
3           3  Emily   28   55000         HR  5500.0           3
4           4  Saint   35   70000    Finance  7000.0           4

#### Transform - Clean & Process

In [16]:
# 5% Salary Increment
df['Salary'] = df['Salary'] * 1.05

In [17]:
df['Experience'] = df['Age'].apply(lambda x: 'Senior' if x >= 30 else 'Junior')

In [18]:
df

   Unnamed: 0   Name  Age   Salary Department   Bonus Experience
0           0   John   25  52500.0   Data Eng  5000.0     Junior
1           1   Alex   30  63000.0  Analytics  6000.0     Senior
2           2   Sara   22  47250.0         IT  4500.0     Junior
3           3  Emily   28  57750.0         HR  5500.0     Junior
4           4  Saint   35  73500.0    Finance  7000.0     Senior

In [19]:
df.to_csv('processed_employee_data.csv', index=False)

In [20]:
print('ETL process Completed! Processed file save.')

ETL process Completed! Processed file save.

#### Modify the transformation step to classify employees as Beginner (0-2 years), Intermediate (3-5 years), Expert (5+ years) based on experience.

In [21]:
np.random.seed(42)

In [22]:
df['Experience'] = np.random.randint(0, 10, df.shape[0])
df

   Unnamed: 0   Name  Age   Salary Department   Bonus  Experience
0           0   John   25  52500.0   Data Eng  5000.0           6
1           1   Alex   30  63000.0  Analytics  6000.0           3
2           2   Sara   22  47250.0         IT  4500.0           7
3           3  Emily   28  57750.0         HR  5500.0           4
4           4  Saint   35  73500.0    Finance  7000.0           6

In [23]:
def classify_exp(exp):
    if exp <=2:
        return 'Beginner'
    elif 3 <= exp <= 5:
        return 'Intermediate'
    else:
        return 'Expert'

df['Experience_level'] = df['Experience'].apply(classify_exp)

In [24]:
df

,Unnamed: 0,Name,Age,Salary,Department,Bonus,Experience,Experience_level
0,0,John,25,52500.0,Data Eng,5000.0,6,Expert
1,1,Alex,30,63000.0,Analytics,6000.0,3,Intermediate
2,2,Sara,22,47250.0,IT,4500.0,7,Expert
3,3,Emily,28,57750.0,HR,5500.0,4,Intermediate
4,4,Saint,35,73500.0,Finance,7000.0,6,Expert

In [25]:
df.to_csv('processed_employee_data.csv', index=False)
print('ETL process complete! Processed file saved')

ETL process complete! Processed file saved

#### Create a column Tax (10% of salary) and deduct it from the salary.

In [26]:
df['Tax'] = df['Salary'] * 0.10
df

,Unnamed: 0,Name,Age,Salary,Department,Bonus,Experience,Experience_level,Tax
0,0,John,25,52500.0,Data Eng,5000.0,6,Expert,5250.0
1,1,Alex,30,63000.0,Analytics,6000.0,3,Intermediate,6300.0
2,2,Sara,22,47250.0,IT,4500.0,7,Expert,4725.0
3,3,Emily,28,57750.0,HR,5500.0,4,Intermediate,5775.0
4,4,Saint,35,73500.0,Finance,7000.0,6,Expert,7350.0

In [27]:
df['Net Salary'] = df['Salary'] - df['Tax']
df

,Unnamed: 0,Name,Age,Salary,Department,Bonus,Experience,Experience_level,Tax,Net Salary
0,0,John,25,52500.0,Data Eng,5000.0,6,Expert,5250.0,47250.0
1,1,Alex,30,63000.0,Analytics,6000.0,3,Intermediate,6300.0,56700.0
2,2,Sara,22,47250.0,IT,4500.0,7,Expert,4725.0,42525.0
3,3,Emily,28,57750.0,HR,5500.0,4,Intermediate,5775.0,51975.0
4,4,Saint,35,73500.0,Finance,7000.0,6,Expert,7350.0,66150.0

In [28]:
df.to_csv('processed_employee_data.csv', index=False)
print('ETL process complete! Processed file saved')

ETL process complete! Processed file saved